<a href="https://colab.research.google.com/github/suraj11kasasudhan/vgg16_image_classification/blob/main/unsupervised.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
unsupervised learning ?

what are the problesm we face during unsupervised learning?
--
clusteing:
--grouping

k means clusteing:
       
       1.Start with random point (how many random ?)
       2.distance of every data point ,we will assign groups based on smaller value 
      3.adjusting of centoid

      4 how do we choose best k value --- elbow method 

      for every value of k we chooe  we will get sum of square
      k=1 s=?
      k=2 s=?
      k=3 s=?


    Silhoutte:

In [1]:
import pandas as pd
path="https://raw.githubusercontent.com/codebasics/py/master/ML/13_kmeans/income.csv"
df=pd.read_csv(path)
df.head()
#now this is out dataset

      Name  Age  Income($)
0      Rob   27      70000
1  Michael   29      90000
2    Mohan   29      61000
3   Ismail   28      60000
4     Kory   42     150000